#+OPTIONS: ^:{}
#+begin_src sh :results output :exports results
/home/ashroyer/mambaforge/envs/dev/bin/python3 main.py -h
#+end_src

#+RESULTS:
#+begin_example
usage: main.py [-h] tmp out

Create musl-1.2.4 dataset, train models, report accuracy.

positional arguments:
  tmp         build directory for generating dataset
  out         results and figures will go here

options:
  -h, --help  show this help message and exit
#+end_example

This project aims to improve the state of the art in reverse engineering and binary static analysis.
We focus on the specific case of binary executable code without debug symbols.

Statically linked binary formats are a common way to deploy programs to end-users, but they are opaque and difficult to analyze for security purposes.
Malware authors also intentionally make their code harder to analyze using obfuscation.
This can circumvent antivirus and malware detection software, so we specifically train on obfuscated data.

# Install prerequisites using anaconda and activate python environment:

# #+begin_src sh
# conda create -f torch.yml
# conda activate torch
# #+end_src

* Dataset preprocessing
Starting with the stripped object files, we apply further processing for use with some of the machine learning models.

#+begin_src python :results output drawer
from _utils import fname
from collections import Counter
from pathlib import Path
import numpy as np
c1 = Counter(fname(p) for p in Path('out/o').glob('*.o'))
c2 = Counter(fname(p) for p in Path('out/o_bb').glob('*'))
a1 = np.array(list(c1.values()))
a2 = np.array(list(c2.values()))
print(f'| name | obfuscated (\mu={a1.mean():.1f},\sigma={a1.std():.1f}) | block sampled (\mu={a2.mean():.1f},\sigma={a2.std():.1f})|')
print('|--|--|--|')
for (k1,v1),(_,v2) in zip(sorted(c1.items()),sorted(c2.items())):
 print(f'|{k1} | {v1} | {v2} |')

#+end_src

#+RESULTS:
:results:
| name      | object file (\mu=1132.3,\sigma=77.6) | sampled (\mu=10097.4,\sigma=8692.7) |
|-----------+--------------------------------------+-------------------------------------|
| abs       |                                  843 |                                2349 |
| acos      |                                 1168 |                               15214 |
| asin      |                                 1168 |                               14068 |
| atan2     |                                 1084 |                               20914 |
| ceil      |                                 1168 |                                7772 |
| cos       |                                 1168 |                               10043 |
| daemon    |                                 1030 |                               10385 |
| floor     |                                 1168 |                                7387 |
| inet_addr |                                 1140 |                                3878 |
| inet_aton |                                 1140 |                               11469 |
| isalnum   |                                 1222 |                                2819 |
| memccpy   |                                 1152 |                                7533 |
| memcmp    |                                 1072 |                                4866 |
| memmem    |                                 1222 |                               29691 |
| sin       |                                 1168 |                               12776 |
| stpcpy    |                                 1156 |                                6150 |
| stpncpy   |                                 1164 |                                8221 |
| strchr    |                                 1129 |                                4126 |
| strcpy    |                                 1032 |                                2365 |
| strncpy   |                                 1074 |                                2552 |
| strstr    |                                 1222 |                               40261 |
| strtok    |                                 1168 |                                8126 |
| tan       |                                 1168 |                                9534 |
| utime     |                                 1153 |                                4442 |
| wmemmove  |                                 1128 |                                5495 |
:end:

